#SKD101|rating_system|9|2014.04.03 14:47:30|166|5|4|3|145|4|5

DROP TABLE IF EXISTS `archive`;
CREATE TABLE `archive` (
  `student_id` int(255) NOT NULL,
  `course` tinyint(2) NOT NULL,
  `semester` tinyint(3) NOT NULL,
  `year` year(4) NOT NULL,
  `subject_id` int(255) NOT NULL,
  `mark` tinyint(4) NOT NULL,
  `progress_id` int(255) NOT NULL DEFAULT '0'
) ENGINE=InnoDB /*!40101 DEFAULT CHARSET=utf8 */;

DROP TABLE IF EXISTS `chair`;
CREATE TABLE `chair` (
  `chair_id` tinyint(5) NOT NULL AUTO_INCREMENT,
  `speciality_id` tinyint(5) NOT NULL,
  `chair_name` varchar(100) NOT NULL,
  PRIMARY KEY (`chair_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 /*!40101 DEFAULT CHARSET=utf8 */;

INSERT INTO `chair` VALUES
(1, 2, 'Информационных систем'),
(3, 2, 'Программирования и информационных технологий'),
(4, 4, 'Информационных систем'),
(5, 4, 'Цифровых технологий'),
(6, 5, 'Защита информации');

DROP TABLE IF EXISTS `progress`;
CREATE TABLE `progress` (
  `student_id` int(255) NOT NULL,
  `course` tinyint(2) NOT NULL,
  `semester` tinyint(3) NOT NULL,
  `year` year(4) NOT NULL,
  `subject_id` int(255) NOT NULL,
  `mark` tinyint(4) NOT NULL,
  `progress_id` int(255) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`progress_id`)
) ENGINE=InnoDB /*!40101 DEFAULT CHARSET=utf8 */;

DROP TABLE IF EXISTS `speciality`;
CREATE TABLE `speciality` (
  `speciality_id` tinyint(5) NOT NULL AUTO_INCREMENT,
  `speciality_name` varchar(100) NOT NULL,
  PRIMARY KEY (`speciality_id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 /*!40101 DEFAULT CHARSET=utf8 */;

INSERT INTO `speciality` VALUES
(2, 'Информационные системы и технологии'),
(3, 'Математика и компьютерные науки'),
(4, 'Информационные системы(Бакалавры)'),
(5, 'Програмная инженерия');

DROP TABLE IF EXISTS `specialization`;
CREATE TABLE `specialization` (
  `specialization_id` tinyint(5) NOT NULL AUTO_INCREMENT,
  `chair_id` tinyint(5) NOT NULL,
  `specialization_name` varchar(100) NOT NULL,
  PRIMARY KEY (`specialization_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 /*!40101 DEFAULT CHARSET=utf8 */;

INSERT INTO `specialization` VALUES
(1, 1, 'информационные системы и технологии в сетевых технологиях'),
(2, 3, 'информационные системы и технологии на предприятиях'),
(4, 1, 'Информационные системы в телекоммуникациях');

DROP TABLE IF EXISTS `stud_positions`;
CREATE TABLE `stud_positions` (
  `position_id` int(255) NOT NULL AUTO_INCREMENT,
  `course` tinyint(1) NOT NULL,
  `speciality_id` int(255) NOT NULL,
  `chair_id` int(255) NOT NULL,
  `specialization_id` int(255) NOT NULL,
  `bachelor` tinyint(1) NOT NULL,
  PRIMARY KEY (`position_id`)
) ENGINE=InnoDB /*!40101 DEFAULT CHARSET=utf8 */;

DROP TABLE IF EXISTS `students`;
CREATE TABLE `students` (
  `student_id` int(255) NOT NULL AUTO_INCREMENT,
  `student` varchar(100) NOT NULL,
  `stud_course` tinyint(1) NOT NULL,
  `stud_group` tinyint(1) NOT NULL,
  `position_id` int(255) NOT NULL,
  `start_year` year(4) NOT NULL,
  `end_year` year(4) NOT NULL,
  PRIMARY KEY (`student_id`)
) ENGINE=InnoDB AUTO_INCREMENT=473 /*!40101 DEFAULT CHARSET=utf8 */;

INSERT INTO `students` VALUES
(328, 'Вендин И.О.', 5, 1, 0, 2013, 2014),
(329, 'Головина Т.А.', 5, 1, 0, 2013, 2014),
(330, 'Гончаров А.И.', 5, 1, 0, 2013, 2014),
(331, 'Городничева А.А.', 5, 1, 0, 2013, 2014),
(332, 'Зенфиров И.К.', 5, 1, 0, 2013, 2014),
(333, 'Коломыцева Ю.Ю.', 5, 1, 0, 2013, 2014),
(334, 'Лазукин А.В.', 5, 1, 0, 2013, 2014),
(335, 'Лукин Е.О.', 5, 1, 0, 2013, 2014),
(336, 'Мазаев В.Н.', 5, 1, 0, 2013, 2014),
(337, 'Меркулова И.С.', 5, 1, 0, 2013, 2014),
(338, 'Науменко А.С.', 5, 1, 0, 2013, 2014),
(339, 'Пашенцева А.С.', 5, 1, 0, 2013, 2014),
(340, 'Петрушин И.А.', 5, 1, 0, 2013, 2014),
(341, 'Полухина Н.Ю.', 5, 1, 0, 2013, 2014),
(342, 'Рагуцкий А.И.', 5, 1, 0, 2013, 2014),
(343, 'Решетов А.А.', 5, 1, 0, 2013, 2014),
(344, 'Руфанов С.А.', 5, 1, 0, 2013, 2014),
(345, 'Смирнов А.А.', 5, 1, 0, 2013, 2014),
(346, 'Торговцев С.С.', 5, 1, 0, 2013, 2014),
(347, 'Филимонов Н.О.', 5, 1, 0, 2013, 2014),
(348, 'Фролова Л.С.', 5, 1, 0, 2013, 2014),
(349, 'Фуртак Р.М.', 5, 1, 0, 2013, 2014),
(350, 'Черников В.С.', 5, 1, 0, 2013, 2014),
(351, 'Щеголеватых П.А.', 5, 1, 0, 2013, 2014),
(352, 'Адаменко А.А.', 5, 2, 0, 2013, 2014),
(353, 'Воронцова Н.В.', 5, 2, 0, 2013, 2014),
(354, 'Марченко К.Г.', 5, 2, 0, 2013, 2014),
(355, 'Писаченко В.А.', 5, 2, 0, 2013, 2014),
(356, 'Рапава Т.Э.', 5, 2, 0, 2013, 2014),
(357, 'Шипулина Э.И.', 5, 2, 0, 2013, 2014),
(358, 'Бабина А.С.', 5, 3, 0, 2013, 2014),
(359, 'Белобородов А.Е.', 5, 3, 0, 2013, 2014),
(360, 'Блинов И.А.', 5, 3, 0, 2013, 2014),
(361, 'Зотов В.В.', 5, 3, 0, 2013, 2014),
(362, 'Карандеев А.С.', 5, 3, 0, 2013, 2014),
(363, 'Кондюрина А.К.', 5, 3, 0, 2013, 2014),
(364, 'Котелевский Д.М.', 5, 3, 0, 2013, 2014),
(365, 'Мигаль А.Д.', 5, 3, 0, 2013, 2014),
(366, 'Нужных А.В.', 5, 3, 0, 2013, 2014),
(367, 'Суровцев А.С.', 5, 3, 0, 2013, 2014),
(368, 'Шилов А.С.', 5, 3, 0, 2013, 2014),
(369, 'Шульгин Д.В.', 5, 3, 0, 2013, 2014),
(370, 'Алексеенко Е.Н.', 4, 1, 0, 2013, 2014),
(371, 'Алехин А.И.', 4, 1, 0, 2013, 2014),
(372, 'Анискин А.В.', 4, 1, 0, 2013, 2014),
(373, 'Беляева С.Ю.', 4, 1, 0, 2013, 2014),
(374, 'Бобак А.А.', 4, 1, 0, 2013, 2014),
(375, 'Большаков Д.Ю.', 4, 1, 0, 2013, 2014),
(376, 'Бондарец И.М.', 4, 1, 0, 2013, 2014),
(377, 'Воронин Н.Ю.', 4, 1, 0, 2013, 2014),
(378, 'Галиулин Д.С.', 4, 1, 0, 2013, 2014),
(379, 'Гусейнов Э.А.', 4, 1, 0, 2013, 2014),
(380, 'Калашников А.Ю.', 4, 1, 0, 2013, 2014),
(381, 'Котова М.А.', 4, 1, 0, 2013, 2014),
(382, 'Курочкин А.С.', 4, 1, 0, 2013, 2014),
(383, 'Левин В.С.', 4, 1, 0, 2013, 2014),
(384, 'Лукашевич М.С.', 4, 1, 0, 2013, 2014),
(385, 'Мезин Д.А.', 4, 1, 0, 2013, 2014),
(386, 'Мусин Н.А.', 4, 1, 0, 2013, 2014),
(387, 'Перепёлкина М.Н.', 4, 1, 0, 2013, 2014),
(388, 'Пешков А.А.', 4, 1, 0, 2013, 2014),
(389, 'Попов Д.Ю.', 4, 1, 0, 2013, 2014),
(390, 'Попов С.С.', 4, 1, 0, 2013, 2014),
(391, 'Ряполов А.А.', 4, 1, 0, 2013, 2014),
(392, 'Сафронова Ю.И.', 4, 1, 0, 2013, 2014),
(393, 'Тетин С.Э.', 4, 1, 0, 2013, 2014),
(394, 'Фомин Г.А.', 4, 1, 0, 2013, 2014),
(395, 'Черепнин В.С.', 4, 1, 0, 2013, 2014),
(396, 'Ахмед Зубаир', 4, 2, 0, 2013, 2014),
(397, 'Ашрафи Арифа', 4, 2, 0, 2013, 2014),
(398, 'Бондаренко В.Е.', 4, 2, 0, 2013, 2014),
(399, 'Бурцева И.Ю.', 4, 2, 0, 2013, 2014),
(400, 'Гаврилов Д.А.', 4, 2, 0, 2013, 2014),
(401, 'Глушков Д.С.', 4, 2, 0, 2013, 2014),
(402, 'Гончаров А.А.', 4, 2, 0, 2013, 2014),
(403, 'Донских Н.С.', 4, 2, 0, 2013, 2014),
(404, 'Есин А.В.', 4, 2, 0, 2013, 2014),
(405, 'Коврижкина А.А.', 4, 2, 0, 2013, 2014),
(406, 'Колиух К.С.', 4, 2, 0, 2013, 2014),
(407, 'Константинов Л.В.', 4, 2, 0, 2013, 2014),
(408, 'Марте П. Венди', 4, 2, 0, 2013, 2014),
(409, 'Мирзаев Н.Х.', 4, 2, 0, 2013, 2014),
(410, 'Павлов П.С.', 4, 2, 0, 2013, 2014),
(411, 'Паринов А.В.', 4, 2, 0, 2013, 2014),
(412, 'Пастухов А.Ю.', 4, 2, 0, 2013, 2014),
(413, 'Пономарева В.О.', 4, 2, 0, 2013, 2014),
(414, 'Поташкин С.С.', 4, 2, 0, 2013, 2014),
(415, 'Раков В.Ю.', 4, 2, 0, 2013, 2014),
(416, 'Рыжко Д.С.', 4, 2, 0, 2013, 2014),
(417, 'Сагор Мд Э.', 4, 2, 0, 2013, 2014),
(418, 'Сатуров Е.В.', 4, 2, 0, 2013, 2014),
(419, 'Скробот А.Н.', 4, 2, 0, 2013, 2014),
(420, 'Скугоров Е.А.', 4, 2, 0, 2013, 2014),
(421, 'Ускова В.В.', 4, 2, 0, 2013, 2014),
(422, 'Хоссаин А.У.', 4, 2, 0, 2013, 2014),
(423, 'Шевцова В.А.', 4, 2, 0, 2013, 2014),
(424, 'Биндюков М.А.', 4, 3, 0, 2013, 2014),
(425, 'Вознесенская Г.Н.', 4, 3, 0, 2013, 2014),
(426, 'Высоцкий Д.Ю.', 4, 3, 0, 2013, 2014),
(427, 'Горбунов Д.М.', 4, 3, 0, 2013, 2014),
(428, 'Горкин П.А.', 4, 3, 0, 2013, 2014),
(429, 'Ешин С.С.', 4, 3, 0, 2013, 2014),
(430, 'Желтухина О.В.', 4, 3, 0, 2013, 2014),
(431, 'Климов К.В.', 4, 3, 0, 2013, 2014),
(432, 'Коротких А.А.', 4, 3, 0, 2013, 2014),
(433, 'Кузьменко М.С.', 4, 3, 0, 2013, 2014),
(434, 'Манущева А.В.', 4, 3, 0, 2013, 2014),
(435, 'Музыченко В.А.', 4, 3, 0, 2013, 2014),
(436, 'Петриев Р.И.', 4, 3, 0, 2013, 2014),
(437, 'Татаринцев Д.М.', 4, 3, 0, 2013, 2014),
(438, 'Тестов Б.М.', 4, 3, 0, 2013, 2014),
(439, 'Шаповалов Д.С.', 4, 3, 0, 2013, 2014),
(440, 'Шевляков А.О.', 4, 3, 0, 2013, 2014),
(441, 'Шишкин А.М.', 4, 3, 0, 2013, 2014),
(442, 'Балабаев А.В.', 4, 4, 0, 2013, 2014),
(443, 'Бардаков А.А.', 4, 4, 0, 2013, 2014),
(444, 'Бондаренко В.С.', 4, 4, 0, 2013, 2014),
(445, 'Бубнов А.П.', 4, 4, 0, 2013, 2014),
(446, 'Бурлуцкий С.А.', 4, 4, 0, 2013, 2014),
(447, 'Врагов Р.В.', 4, 4, 0, 2013, 2014),
(448, 'Донских А.О.', 4, 4, 0, 2013, 2014),
(449, 'Елфимов С.С.', 4, 4, 0, 2013, 2014),
(450, 'Качуровский Д.В.', 4, 4, 0, 2013, 2014),
(451, 'Матвеев В.Д.', 4, 4, 0, 2013, 2014),
(452, 'Мельников П.М.', 4, 4, 0, 2013, 2014),
(453, 'Скворцов М.В.', 4, 4, 0, 2013, 2014),
(454, 'Старцев А.А.', 4, 4, 0, 2013, 2014),
(455, 'Таранина Е.А.', 4, 4, 0, 2013, 2014),
(456, 'Чурсин А.Г.', 4, 4, 0, 2013, 2014),
(457, 'Шишкин А.П.', 4, 4, 0, 2013, 2014),
(458, 'Бугаков Д. А.', 4, 5, 0, 2013, 2014),
(459, 'Буйволенко С. С.', 4, 5, 0, 2013, 2014),
(460, 'Белый Г.Ю.', 4, 5, 0, 2013, 2014),
(461, 'Валюженич Д. А.', 4, 5, 0, 2013, 2014),
(462, 'Грищенко С.И.', 4, 5, 0, 2013, 2014),
(463, 'Жинкин Д. Д.', 4, 5, 0, 2013, 2014),
(464, 'Лаврентьева Д. Е.', 4, 5, 0, 2013, 2014),
(465, 'Никонова М. А.', 4, 5, 0, 2013, 2014),
(466, 'Новичихин Д. Ю.', 4, 5, 0, 2013, 2014),
(467, 'Павлова Е. А.', 4, 5, 0, 2013, 2014),
(468, 'Петряев Е. Д.', 4, 5, 0, 2013, 2014),
(469, 'Потапова В. А.', 4, 5, 0, 2013, 2014),
(470, 'Савченко А. Ю.', 4, 5, 0, 2013, 2014),
(471, 'Саранцев Д. В.', 4, 5, 0, 2013, 2014),
(472, 'Четкин А. С.', 4, 5, 0, 2013, 2014);

DROP TABLE IF EXISTS `subjects`;
CREATE TABLE `subjects` (
  `subject_id` int(255) NOT NULL AUTO_INCREMENT,
  `subject_name` varchar(100) NOT NULL,
  `speciality_id` tinyint(5) NOT NULL,
  `specialization_id` varchar(50) NOT NULL,
  `course` tinyint(5) NOT NULL,
  `semester` tinyint(2) NOT NULL,
  PRIMARY KEY (`subject_id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 /*!40101 DEFAULT CHARSET=utf8 */;

INSERT INTO `subjects` VALUES
(1, 'Квантовая механика', 0, '0', 3, 6),
(2, 'Диффуры', 0, '0', 2, 3),
(3, 'Психология', 0, '0', 4, 8),
(4, 'Матан', 0, '0', 1, 1);

DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `user_id` int(255) NOT NULL AUTO_INCREMENT,
  `login` varchar(25) NOT NULL,
  `password` varchar(32) NOT NULL,
  `grades` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `login` (`login`)
) ENGINE=InnoDB AUTO_INCREMENT=19 /*!40101 DEFAULT CHARSET=utf8 */;

INSERT INTO `users` VALUES
(10, 'test', '3cdf5666859f6906c283a1058cd5b9a7', 0),
(11, 'test2', '3cdf5666859f6906c283a1058cd5b9a7', 0),
(12, 'test3', '3cdf5666859f6906c283a1058cd5b9a7', 0),
(16, 'andrei', '3cdf5666859f6906c283a1058cd5b9a7', 0),
(17, 'user', '3cdf5666859f6906c283a1058cd5b9a7', 0);

